# coding:utf-8

# 本文件为邮航项目初始化文件

domain = 'fibosstore.cn'

http_head = 'https://'


#dev MySQL init info#
MySQL_HOST = 'cdb-cs7cw2a1.gz.tencentcdb.com'
MySQL_PORT = '10083'
MySQL_Name = 'dev_cnpostair'
MySQL_UserName = 'dev'
MySQL_UserPassword = 'MZLBXNyHDf6*KxL2igtN+oCY(C6-vL9a3Z$&pVBEH4XJ#4CRQCr3XbptzRmz7_@'

#MySQL init info#
MySQL_HOST = 'cdb-cs7cw2a1.gz.tencentcdb.com'
MySQL_PORT = '10083'
MySQL_Name = 'dev_cnpostair'
MySQL_UserName = 'dev'
MySQL_UserPassword = 'MZLBXNyHDf6*KxL2igtN+oCY(C6-vL9a3Z$&pVBEH4XJ#4CRQCr3XbptzRmz7_@'


# 企业微信参数
qy_weixin_CorpID = 'wxe736c12ef5dc6c05'
qy_weixin_Secret = 'CiL0l-YQbV3sgmIUc6-Z7rtaxFcsbqc160T9rx9iv5Nn45qUSDP35SniEyZDTNqQ'

# 任务匹配度
matching_degree = 0.6

RatingSystemType = (
    ("日常表现：综合","日常表现：综合"),
    ("日常表现：技能","日常表现：技能"),
    ("日常表现：态度","日常表现：态度"),
    ("日常表现：团队", "日常表现：团队"),
    ("日常表现：服务", "日常表现：服务"),
    ("日常表现：判断", "日常表现：判断"),
    ("任务自评","任务自评"),
    ("任务互评","任务互评")
)
LogAction = (
    ("create","创建"),("delete","删除"),("modify","修改"),("others","其他")
)
task_feedback_role = (
    ("实习者","实习者"),("工作者","工作者"),("检验","检验"),("放行","放行"),
)
task_source = (
    ("计划","计划"),("现场","现场")
)
task_type = (
    ("工卡","工卡"),("排故","排故"),("勤务","勤务"),("其他","其他")
)
task_status = ( # 请勿随意修改，'关闭'任务无法加入任务包
    ("未生效","未生效"),("生效","生效"),("关闭","关闭")
)
task_finish_status = (
    ("完成","完成"),("未完成","未完成")
)
task_package_status = (
    ("未生效","未生效"),("生效","生效"),("关闭","关闭")
)
task_feedback_status = (
    ("已完成","已完成"),("未完成","未完成")
)

task_standard_type = (
    ("工卡","工卡"),("AMM","AMM"),("勤务","勤务"),("其他","其他")
)
task_standard_library_status = (
    ("未生效","未生效"),("生效","生效"),("失效","失效")
)
# 民族
nationality = (
  ("汉族","汉族"),("壮族","壮族"),("满族","满族"),("回族","回族"),("苗族","苗族"),
  ("维吾尔族","维吾尔族"),("土家族","土家族"),("彝族","彝族"),("蒙古族","蒙古族"),("藏族","藏族"),
  ("布依族","布依族"),("侗族","侗族"),("瑶族","瑶族"),("朝鲜族","朝鲜族"),("白族","白族"),
  ("哈尼族","哈尼族"),("哈萨克族","哈萨克族"),("黎族","黎族"),("傣族","傣族"),("畲族","畲族"),
  ("傈僳族","傈僳族"),("仡佬族","仡佬族"),("东乡族","东乡族"),("高山族","高山族"),("拉祜族","拉祜族"),
  ("水族","水族"),("佤族","佤族"),("纳西族","纳西族"),("羌族","羌族"),("土族","土族"),
  ("仫佬族","仫佬族"),("锡伯族","锡伯族"),("柯尔克孜族","柯尔克孜族"),("达斡尔族","达斡尔族"),("景颇族","景颇族"),
  ("毛南族","毛南族"),("撒拉族","撒拉族"),("布朗族","布朗族"),("塔吉克族","塔吉克族"),("阿昌族","阿昌族"),
  ("普米族","普米族"),("鄂温克族","鄂温克族"),("怒族","怒族"),("京族","京族"),("基诺族","基诺族"),
  ("德昂族","德昂族"),("保安族","保安族"),("俄罗斯族","俄罗斯族"),("裕固族","裕固族"),("乌孜别克族","乌孜别克族"),
  ("门巴族","门巴族"),("鄂伦春族","鄂伦春族"),("独龙族","独龙族"),("塔塔尔族","塔塔尔族"),("赫哲族","赫哲族"),
  ("珞巴族","珞巴族")
)

nativePlace = (
    ("上海","上海"), ("江苏","江苏"), ("浙江","浙江"), ("安徽","安徽"), ("北京","北京"),
    ("天津","天津"), ("广东","广东"), ("河北","河北"), ("河南","河南"), ("山东","山东"),
    ("湖北","湖北"), ("湖南","湖南"), ("江西","江西"), ("福建","福建"), ("四川","四川"),
    ("重庆","重庆"), ("广西","广西"), ("山西","山西"), ("辽宁","辽宁"), ("吉林","吉林"),
    ("黑龙江","黑龙江"), ("贵州","贵州"), ("陕西","陕西"), ("云南","云南"), ("内蒙古","内蒙古"),
    ("甘肃","甘肃"), ("青海","青海"), ("宁夏","宁夏"), ("新疆","新疆"), ("海南","海南"),
    ("西藏","西藏"), ("香港","香港"), ("澳门","澳门"), ("台湾","台湾"),("其他","其他")
)

politicsStatus = (
    ("中共党员","中共党员"),("中共预备党员","中共预备党员"),("共青团员","共青团员"),("其他党派","其他党派"),("无党派人士","无党派人士"),("群众","群众")
)

education = (
    ("博士","博士"),("硕士","硕士"),("本科","本科"),("专科","专科"),("高中","高中"),("初中","初中"),("小学","小学"),("无","无")
)

nanjing_airplane_position=(
    ("601","601"),("602","602"),("603","603"),("604","604"),("605","605"),
    ("606","606"),("607","607"),("608","608"),("609","609"),("610","610"),
    ("611","611"),("612","612"),("613","613"),("614","614"),("621","621"),
    ("622","622"),("623","623"),("624","624"),("625","625"),("626","626"),
)